<a href="https://colab.research.google.com/github/yamangoyal29/ASSIGNMENTS/blob/main/data_cleaning_using_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [58]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [59]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [60]:
df['FlightNumber']=df['FlightNumber'].interpolate()

In [61]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [62]:
df['FlightNumber'].astype(int)

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

In [66]:
df[['from','to']]=df.From_To.str.split("_",expand=True)

In [72]:
df['from']=df['from'].str.lower()

In [74]:
df['from']=df['from'].str.title()

In [76]:
df['to']=df['to'].str.lower()

In [78]:
df['to']=df['to'].str.title()

In [79]:
df

            From_To  FlightNumber  ...      from         to
0      LoNDon_paris       10045.0  ...    London      Paris
1      MAdrid_miLAN       10055.0  ...    Madrid      Milan
2  londON_StockhOlm       10065.0  ...    London  Stockholm
3    Budapest_PaRis       10075.0  ...  Budapest      Paris
4   Brussels_londOn       10085.0  ...  Brussels     London

[5 rows x 6 columns]

In [90]:
df.drop(['From_To'], axis=1,inplace=True)

In [84]:
df['delay_1']=['23','0','24','13','67']

In [85]:
df

            From_To  FlightNumber  RecentDelays  ...      from         to delay_1
0      LoNDon_paris       10045.0      [23, 47]  ...    London      Paris      23
1      MAdrid_miLAN       10055.0            []  ...    Madrid      Milan       0
2  londON_StockhOlm       10065.0  [24, 43, 87]  ...    London  Stockholm      24
3    Budapest_PaRis       10075.0          [13]  ...  Budapest      Paris      13
4   Brussels_londOn       10085.0      [67, 32]  ...  Brussels     London      67

[5 rows x 7 columns]

In [86]:
df['delay_2']=['47','0','43','0','32']
df['delay_3']=['0','0','87','0','0']

In [87]:
df

            From_To  FlightNumber  RecentDelays  ... delay_1 delay_2 delay_3
0      LoNDon_paris       10045.0      [23, 47]  ...      23      47       0
1      MAdrid_miLAN       10055.0            []  ...       0       0       0
2  londON_StockhOlm       10065.0  [24, 43, 87]  ...      24      43      87
3    Budapest_PaRis       10075.0          [13]  ...      13       0       0
4   Brussels_londOn       10085.0      [67, 32]  ...      67      32       0

[5 rows x 9 columns]

In [89]:
df.drop(['RecentDelays'], axis=1,inplace=True)

In [91]:
df

   FlightNumber              Airline      from  ... delay_1 delay_2 delay_3
0       10045.0               KLM(!)    London  ...      23      47       0
1       10055.0    <Air France> (12)    Madrid  ...       0       0       0
2       10065.0  (British Airways. )    London  ...      24      43      87
3       10075.0       12. Air France  Budapest  ...      13       0       0
4       10085.0          "Swiss Air"  Brussels  ...      67      32       0

[5 rows x 7 columns]